Loaded (1014, 256, 256, 3) (1014, 256, 256, 3)
Model: "model_4"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_5 (InputLayer)            (None, 256, 256, 3)  0                                            
__________________________________________________________________________________________________
input_6 (InputLayer)            (None, 256, 256, 3)  0                                            
__________________________________________________________________________________________________
concatenate_9 (Concatenate)     (None, 256, 256, 6)  0           input_5[0][0]                    
                                                                 input_6[0][0]                    
__________________________________________________________________________________________________
conv2d_15 (Conv2D)              (None, 128, 128, 64) 6208        concatenate_9[0][0]              
__________________________________________________________________________________________________
leaky_re_lu_13 (LeakyReLU)      (None, 128, 128, 64) 0           conv2d_15[0][0]                  
__________________________________________________________________________________________________
conv2d_16 (Conv2D)              (None, 64, 64, 128)  131200      leaky_re_lu_13[0][0]             
__________________________________________________________________________________________________
batch_normalization_18 (BatchNo (None, 64, 64, 128)  512         conv2d_16[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_14 (LeakyReLU)      (None, 64, 64, 128)  0           batch_normalization_18[0][0]     
__________________________________________________________________________________________________
conv2d_17 (Conv2D)              (None, 32, 32, 256)  524544      leaky_re_lu_14[0][0]             
__________________________________________________________________________________________________
batch_normalization_19 (BatchNo (None, 32, 32, 256)  1024        conv2d_17[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_15 (LeakyReLU)      (None, 32, 32, 256)  0           batch_normalization_19[0][0]     
__________________________________________________________________________________________________
conv2d_18 (Conv2D)              (None, 16, 16, 512)  2097664     leaky_re_lu_15[0][0]             
__________________________________________________________________________________________________
batch_normalization_20 (BatchNo (None, 16, 16, 512)  2048        conv2d_18[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_16 (LeakyReLU)      (None, 16, 16, 512)  0           batch_normalization_20[0][0]     
__________________________________________________________________________________________________
conv2d_19 (Conv2D)              (None, 16, 16, 512)  4194816     leaky_re_lu_16[0][0]             
__________________________________________________________________________________________________
batch_normalization_21 (BatchNo (None, 16, 16, 512)  2048        conv2d_19[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_17 (LeakyReLU)      (None, 16, 16, 512)  0           batch_normalization_21[0][0]     
__________________________________________________________________________________________________
conv2d_20 (Conv2D)              (None, 16, 16, 1)    8193        leaky_re_lu_17[0][0]             
__________________________________________________________________________________________________
activation_11 (Activation)      (None, 16, 16, 1)    0           conv2d_20[0][0]                  
==================================================================================================
Total params: 6,968,257
Trainable params: 6,965,441
Non-trainable params: 2,816
__________________________________________________________________________________________________
Model: "model_5"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_7 (InputLayer)            (None, 256, 256, 3)  0                                            
__________________________________________________________________________________________________
conv2d_21 (Conv2D)              (None, 128, 128, 64) 3136        input_7[0][0]                    
__________________________________________________________________________________________________
leaky_re_lu_18 (LeakyReLU)      (None, 128, 128, 64) 0           conv2d_21[0][0]                  
__________________________________________________________________________________________________
conv2d_22 (Conv2D)              (None, 64, 64, 128)  131200      leaky_re_lu_18[0][0]             
__________________________________________________________________________________________________
batch_normalization_22 (BatchNo (None, 64, 64, 128)  512         conv2d_22[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_19 (LeakyReLU)      (None, 64, 64, 128)  0           batch_normalization_22[0][0]     
__________________________________________________________________________________________________
conv2d_23 (Conv2D)              (None, 32, 32, 256)  524544      leaky_re_lu_19[0][0]             
__________________________________________________________________________________________________
batch_normalization_23 (BatchNo (None, 32, 32, 256)  1024        conv2d_23[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_20 (LeakyReLU)      (None, 32, 32, 256)  0           batch_normalization_23[0][0]     
__________________________________________________________________________________________________
conv2d_24 (Conv2D)              (None, 16, 16, 512)  2097664     leaky_re_lu_20[0][0]             
__________________________________________________________________________________________________
batch_normalization_24 (BatchNo (None, 16, 16, 512)  2048        conv2d_24[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_21 (LeakyReLU)      (None, 16, 16, 512)  0           batch_normalization_24[0][0]     
__________________________________________________________________________________________________
conv2d_25 (Conv2D)              (None, 8, 8, 512)    4194816     leaky_re_lu_21[0][0]             
__________________________________________________________________________________________________
batch_normalization_25 (BatchNo (None, 8, 8, 512)    2048        conv2d_25[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_22 (LeakyReLU)      (None, 8, 8, 512)    0           batch_normalization_25[0][0]     
__________________________________________________________________________________________________
conv2d_26 (Conv2D)              (None, 4, 4, 512)    4194816     leaky_re_lu_22[0][0]             
__________________________________________________________________________________________________
batch_normalization_26 (BatchNo (None, 4, 4, 512)    2048        conv2d_26[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_23 (LeakyReLU)      (None, 4, 4, 512)    0           batch_normalization_26[0][0]     
__________________________________________________________________________________________________
conv2d_27 (Conv2D)              (None, 2, 2, 512)    4194816     leaky_re_lu_23[0][0]             
__________________________________________________________________________________________________
batch_normalization_27 (BatchNo (None, 2, 2, 512)    2048        conv2d_27[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_24 (LeakyReLU)      (None, 2, 2, 512)    0           batch_normalization_27[0][0]     
__________________________________________________________________________________________________
conv2d_28 (Conv2D)              (None, 1, 1, 512)    4194816     leaky_re_lu_24[0][0]             
__________________________________________________________________________________________________
activation_12 (Activation)      (None, 1, 1, 512)    0           conv2d_28[0][0]                  
__________________________________________________________________________________________________
conv2d_transpose_9 (Conv2DTrans (None, 2, 2, 512)    4194816     activation_12[0][0]              
__________________________________________________________________________________________________
batch_normalization_28 (BatchNo (None, 2, 2, 512)    2048        conv2d_transpose_9[0][0]         
__________________________________________________________________________________________________
dropout_4 (Dropout)             (None, 2, 2, 512)    0           batch_normalization_28[0][0]     
__________________________________________________________________________________________________
concatenate_10 (Concatenate)    (None, 2, 2, 1024)   0           dropout_4[0][0]                  
                                                                 leaky_re_lu_24[0][0]             
__________________________________________________________________________________________________
activation_13 (Activation)      (None, 2, 2, 1024)   0           concatenate_10[0][0]             
__________________________________________________________________________________________________
conv2d_transpose_10 (Conv2DTran (None, 4, 4, 512)    8389120     activation_13[0][0]              
__________________________________________________________________________________________________
batch_normalization_29 (BatchNo (None, 4, 4, 512)    2048        conv2d_transpose_10[0][0]        
__________________________________________________________________________________________________
dropout_5 (Dropout)             (None, 4, 4, 512)    0           batch_normalization_29[0][0]     
__________________________________________________________________________________________________
concatenate_11 (Concatenate)    (None, 4, 4, 1024)   0           dropout_5[0][0]                  
                                                                 leaky_re_lu_23[0][0]             
__________________________________________________________________________________________________
activation_14 (Activation)      (None, 4, 4, 1024)   0           concatenate_11[0][0]             
__________________________________________________________________________________________________
conv2d_transpose_11 (Conv2DTran (None, 8, 8, 512)    8389120     activation_14[0][0]              
__________________________________________________________________________________________________
batch_normalization_30 (BatchNo (None, 8, 8, 512)    2048        conv2d_transpose_11[0][0]        
__________________________________________________________________________________________________
dropout_6 (Dropout)             (None, 8, 8, 512)    0           batch_normalization_30[0][0]     
__________________________________________________________________________________________________
concatenate_12 (Concatenate)    (None, 8, 8, 1024)   0           dropout_6[0][0]                  
                                                                 leaky_re_lu_22[0][0]             
__________________________________________________________________________________________________
activation_15 (Activation)      (None, 8, 8, 1024)   0           concatenate_12[0][0]             
__________________________________________________________________________________________________
conv2d_transpose_12 (Conv2DTran (None, 16, 16, 512)  8389120     activation_15[0][0]              
__________________________________________________________________________________________________
batch_normalization_31 (BatchNo (None, 16, 16, 512)  2048        conv2d_transpose_12[0][0]        
__________________________________________________________________________________________________
concatenate_13 (Concatenate)    (None, 16, 16, 1024) 0           batch_normalization_31[0][0]     
                                                                 leaky_re_lu_21[0][0]             
__________________________________________________________________________________________________
activation_16 (Activation)      (None, 16, 16, 1024) 0           concatenate_13[0][0]             
__________________________________________________________________________________________________
conv2d_transpose_13 (Conv2DTran (None, 32, 32, 256)  4194560     activation_16[0][0]              
__________________________________________________________________________________________________
batch_normalization_32 (BatchNo (None, 32, 32, 256)  1024        conv2d_transpose_13[0][0]        
__________________________________________________________________________________________________
concatenate_14 (Concatenate)    (None, 32, 32, 512)  0           batch_normalization_32[0][0]     
                                                                 leaky_re_lu_20[0][0]             
__________________________________________________________________________________________________
activation_17 (Activation)      (None, 32, 32, 512)  0           concatenate_14[0][0]             
__________________________________________________________________________________________________
conv2d_transpose_14 (Conv2DTran (None, 64, 64, 128)  1048704     activation_17[0][0]              
__________________________________________________________________________________________________
batch_normalization_33 (BatchNo (None, 64, 64, 128)  512         conv2d_transpose_14[0][0]        
__________________________________________________________________________________________________
concatenate_15 (Concatenate)    (None, 64, 64, 256)  0           batch_normalization_33[0][0]     
                                                                 leaky_re_lu_19[0][0]             
__________________________________________________________________________________________________
activation_18 (Activation)      (None, 64, 64, 256)  0           concatenate_15[0][0]             
__________________________________________________________________________________________________
conv2d_transpose_15 (Conv2DTran (None, 128, 128, 64) 262208      activation_18[0][0]              
__________________________________________________________________________________________________
batch_normalization_34 (BatchNo (None, 128, 128, 64) 256         conv2d_transpose_15[0][0]        
__________________________________________________________________________________________________
concatenate_16 (Concatenate)    (None, 128, 128, 128 0           batch_normalization_34[0][0]     
                                                                 leaky_re_lu_18[0][0]             
__________________________________________________________________________________________________
activation_19 (Activation)      (None, 128, 128, 128 0           concatenate_16[0][0]             
__________________________________________________________________________________________________
conv2d_transpose_16 (Conv2DTran (None, 256, 256, 3)  6147        activation_19[0][0]              
__________________________________________________________________________________________________
activation_20 (Activation)      (None, 256, 256, 3)  0           conv2d_transpose_16[0][0]        
==================================================================================================
Total params: 54,429,315
Trainable params: 54,419,459
Non-trainable params: 9,856
__________________________________________________________________________________________________
Model: "model_6"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_8 (InputLayer)            (None, 256, 256, 3)  0                                            
__________________________________________________________________________________________________
model_5 (Model)                 (None, 256, 256, 3)  54429315    input_8[0][0]                    
__________________________________________________________________________________________________
model_4 (Model)                 (None, 16, 16, 1)    6968257     input_8[0][0]                    
                                                                 model_5[1][0]                    
==================================================================================================
Total params: 61,397,572
Trainable params: 54,419,459
Non-trainable params: 6,978,113
__________________________________________________________________________________________________
C:\Users\rushi\Anaconda3\lib\site-pa